lvx/base/InformationRegisters/бит_НастройкиДоступностиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиЭлементов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УбратьВидимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБлокироватьСостояниемДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЭлементовУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСтатусовОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРеестре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_ВидыЭлементовУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЭлементовУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнопкаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекорацияФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоманднаяПанель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/CommonModules/бит_НастройкиДоступностиЭлементовФорм/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление достпуностью и проверкой заполнения элементов формы.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет перечень объектов метаданных, для которых определяется настройка доступности элементов.
//
// Возвращаемое значение:
//  СписокЗначений - Элемент списка - СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОбъектыНастройкиДоступностиЭлементов() Экспорт
	
	Возврат бит_НастройкиДоступностиЭлементовФормПовтИсп.ОбъектыНастройкиДоступностиЭлементов();
	
КонецФункции

// Устанавливает запрет редактирования и скрывает видимость элементов управления.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//        - РасширениеУправляемойФормыДляОбъектов - форма объекта, где:
//    * Объект - ДанныеФормыСтруктура
//             - СправочникОбъект
//             - ДокументОбъект
//  Объект - Неопределено - взять объект из реквизита формы "Объект".
//         - СправочникОбъект
//         - ДокументОбъект
//
Процедура ЗаблокироватьЭлементы(Форма, Объект = Неопределено) Экспорт
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);
	
КонецПроцедуры

// Снимает установленные ранее запреты редактирования.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура РазблокироватьЭлементы(Форма) Экспорт
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
	
КонецПроцедуры

// Добавляет реквизиты обязательные для заполнения 
//
// Параметры:
//  Объект - СправочникОбъект
//         - ДокументОбъект
//  ПроверяемыеРеквизиты - Массив.
//
Процедура ЗаполнитьПроверяемыеРеквизиты(Объект, ПроверяемыеРеквизиты) Экспорт
	
	НастройкиДоступности = НастройкиДоступностиЭлементов(Объект);
	Для каждого СтрокаНастройки Из НастройкиДоступности Цикл
		Если НЕ СтрокаНастройки.Обязательное Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = СтрокаНастройки.ИмяРеквизита;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает элементы исключения настройки доступности.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//
// Возвращаемое значение:
//  СписокЗначений - Список имен элементов формы объекта, исключенных из механизама настройки.
//
Функция ЭлементыИсключенияНастройкиДоступности(ОбъектСистемы) Экспорт
	
	ИмяОбъектаПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъектаПолное");
	Возврат бит_НастройкиДоступностиЭлементовФормПовтИсп.ЭлементыИсключенияНастройкиДоступности(ИмяОбъектаПолное);
	
КонецФункции

// Возвращает элементы которые блокируются программно.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//
// Возвращаемое значение:
//  СписокЗначений - Список имен элементов формы объекта, исключенных из механизама настройки.
//
Функция ЭлементыПрограммнойБлокировкиНастройкиДоступности(ОбъектСистемы) Экспорт
	
	ИмяОбъектаПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъектаПолное");
	Возврат бит_НастройкиДоступностиЭлементовФормПовтИсп.ЭлементыПрограммнойБлокировкиНастройкиДоступности(ИмяОбъектаПолное);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устарела. Использовать ПодготовитьФормуНаСервере().
//
Процедура ПриСозданииНаСервере(Форма, СтандартнаяОбработка, ОбъектФормы = Неопределено) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Подготавливает реквизитный состав формы, заполняет настройки доступости и элементы статусов.
//
Процедура ПодготовитьФорму(Форма, ОбъектФормы, СтандартнаяОбработка = Неопределено) Экспорт
	
	Если СтандартнаяОбработка = Неопределено Тогда
		// Вызов при чтении или после записи.
		Если НЕ ФормаПодготовлена(Форма) Тогда
			// Подготовка формы будет выполнена при создании на сервере.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере(Форма, СтандартнаяОбработка, ОбъектФормы);
	
	ОбновитьНастройкиДоступности(Форма, ОбъектФормы);
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(Форма, ОбъектФормы);
	
КонецПроцедуры

Функция НастройкиДоступностиЭлементов(Объект, Форма = Неопределено, ОтборВидЭлемента = Неопределено) Экспорт
	
	Если Форма <> Неопределено Тогда
		Если НЕ ФормаПодготовлена(Форма) Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	ОбъектСистемы     = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(МетаданныеОбъекта.ПолноеИмя());
	ТекущийСтатус     = бит_ВизированиеСервер.ТекущийСтатус(Объект.Ссылка);
	
	ЭлементыБлокируемыеДокументом = Новый ТаблицаЗначений;
	ЭлементыБлокируемыеДокументом.Колонки.Добавить("ИмяЭлементаУправления",
											Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
											
	ОбъектыНастройки = ОбъектыНастройкиДоступностиЭлементов();
	Если ОбъектыНастройки.НайтиПоЗначению(ОбъектСистемы) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Исключения = ЭлементыИсключенияНастройкиДоступности(ОбъектСистемы);
	
	Если Форма <> Неопределено
		И ТекущийСтатус <> Справочники.бит_СтатусыОбъектов.ПустаяСсылка()
		И НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
												Перечисления.бит_ТипыСтатусовОбъектов.Черновик)
		И НЕ бит_ВизированиеСервер.МеханизмВизированияОтключен(Объект.Ссылка) Тогда
		
		Для каждого ЭлементФормы Из Форма.Элементы Цикл
			ИмяЭлементаУправления = ЭлементФормы.Имя;
			Если Исключения.НайтиПоЗначению(ИмяЭлементаУправления) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			БлокироватьЭлемент = Ложь;
			
			ТипЭлемента = ТипЗнч(ЭлементФормы);
			Если ТипЭлемента = Тип("ПолеФормы") ИЛИ ТипЭлемента = Тип("ТаблицаФормы") Тогда
				БлокироватьЭлемент = Истина;
			ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") И НЕ ПустаяСтрока(ЭлементФормы.ИмяКоманды) Тогда
				КомандаФормы = Форма.Команды.Найти(ЭлементФормы.ИмяКоманды);
				Если КомандаФормы <> Неопределено И КомандаФормы.ИзменяетСохраняемыеДанные Тогда
					БлокироватьЭлемент = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если БлокироватьЭлемент Тогда
				СтрокаЭлемента = ЭлементыБлокируемыеДокументом.Добавить();
				СтрокаЭлемента.ИмяЭлементаУправления = ИмяЭлементаУправления;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка КАК ПользовательГруппа,
	|	1 КАК ПриоритетНастройки
	|ПОМЕСТИТЬ ПользователиГруппы
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователей
	|ГДЕ
	|	ГруппыПользователей.Пользователь = &ТекущийПользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ТекущийПользователь,
	|	0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи),
	|	2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиДоступности.ПроизвольноеУсловие КАК ПроизвольноеУсловие,
	|	НастройкиДоступности.ИмяЭлементаУправления КАК ИмяЭлемента,
	|	НастройкиДоступности.УбратьВидимость КАК УбратьВидимость,
	|	НастройкиДоступности.ТолькоПросмотр КАК ТолькоПросмотр,
	|	НастройкиДоступности.Обязательное КАК Обязательное,
	|	НастройкиДоступности.НеБлокироватьСостояниемДокумента КАК НеБлокироватьСостояниемДокумента,
	|	НастройкиДоступности.ИмяРеквизита КАК ИмяРеквизита,
	|	НастройкиДоступности.ВидЭлемента КАК ВидЭлемента,
	|	ПользователиГруппы.ПриоритетНастройки КАК ПриоритетНастройки
	|ПОМЕСТИТЬ НастройкиДоступности
	|ИЗ
	|	ПользователиГруппы КАК ПользователиГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиДоступностиЭлементов КАК НастройкиДоступности
	|		ПО ПользователиГруппы.ПользовательГруппа = НастройкиДоступности.Пользователь
	|			И (НастройкиДоступности.ОбъектСистемы = &ОбъектСистемы)
	|			И (НастройкиДоступности.Статус В (&ТекущийСтатус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)))
	|			И (&ОтборПоВидуЭлемента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭлементыБлокируемыеДокументом.ИмяЭлементаУправления КАК ИмяЭлемента
	|ПОМЕСТИТЬ ЭлементыБлокируемыеДокументом
	|ИЗ
	|	&ЭлементыБлокируемыеДокументом КАК ЭлементыБлокируемыеДокументом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиДоступности.ПроизвольноеУсловие КАК ПроизвольноеУсловие
	|ИЗ
	|	НастройкиДоступности КАК НастройкиДоступности
	|ГДЕ
	|	НастройкиДоступности.ПроизвольноеУсловие <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТекущийПользователь",           Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ОбъектСистемы",                 ОбъектСистемы);
	Запрос.УстановитьПараметр("ТекущийСтатус",                 ТекущийСтатус);
	Запрос.УстановитьПараметр("ЭлементыБлокируемыеДокументом", ЭлементыБлокируемыеДокументом);
	
	ТестОтбораПоВидуЭлемента = "ИСТИНА";
	Если ОтборВидЭлемента <> Неопределено Тогда
		ТестОтбораПоВидуЭлемента = "НастройкиДоступности.ВидЭлемента = &ОтборВидЭлемента";
		Запрос.УстановитьПараметр("ОтборВидЭлемента", ОтборВидЭлемента);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуЭлемента", ТестОтбораПоВидуЭлемента);
	
	ВыполненныеУсловия = Новый Массив;
	ВыполненныеУсловия.Добавить(Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка());
	
	ПараметрыУсловия = Неопределено;
	ВыборкаУсловий = Запрос.Выполнить().Выбрать();
	Если ВыборкаУсловий.Количество() > 0 Тогда
		ПараметрыУсловия = Новый Структура;
		Если Форма <> Неопределено
			И ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
			ОбъектУсловия = Форма.РеквизитФормыВЗначение("Объект");
		Иначе
			ОбъектУсловия = Объект;
		КонецЕсли;
		ПараметрыУсловия.Вставить("ТекущийОбъект", ОбъектУсловия);
	КонецЕсли;
	Пока ВыборкаУсловий.Следующий() Цикл
		ПроизвольноеУсловие = ВыборкаУсловий.ПроизвольноеУсловие;
		Если бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(ПроизвольноеУсловие, ПараметрыУсловия) Тогда
			ВыполненныеУсловия.Добавить(ПроизвольноеУсловие);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиДоступности.ИмяЭлемента КАК ИмяЭлемента,
	|	НастройкиДоступности.ИмяРеквизита КАК ИмяРеквизита,
	|	НастройкиДоступности.ВидЭлемента КАК ВидЭлемента,
	|	НастройкиДоступности.УбратьВидимость КАК УбратьВидимость,
	|	НастройкиДоступности.ТолькоПросмотр КАК ТолькоПросмотр,
	|	НастройкиДоступности.Обязательное КАК Обязательное,
	|	НастройкиДоступности.НеБлокироватьСостояниемДокумента КАК НеБлокироватьСостояниемДокумента,
	|	НастройкиДоступности.ПриоритетНастройки КАК ПриоритетНастройки
	|ПОМЕСТИТЬ ПрименимыеНастройки
	|ИЗ
	|	НастройкиДоступности КАК НастройкиДоступности
	|ГДЕ
	|	НастройкиДоступности.ПроизвольноеУсловие В(&ВыполненныеУсловия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяЭлемента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименимыеНастройки.ИмяЭлемента КАК ИмяЭлемента,
	|	МИНИМУМ(ПрименимыеНастройки.ПриоритетНастройки) КАК ПриоритетНастройки
	|ПОМЕСТИТЬ МинимальныеПриоритеты
	|ИЗ
	|	ПрименимыеНастройки КАК ПрименимыеНастройки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрименимыеНастройки.ИмяЭлемента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименимыеНастройки.ИмяЭлемента КАК ИмяЭлемента,
	|	МАКСИМУМ(ПрименимыеНастройки.ИмяРеквизита) КАК ИмяРеквизита,
	|	МАКСИМУМ(ПрименимыеНастройки.ВидЭлемента) КАК ВидЭлемента,
	|	МАКСИМУМ(ПрименимыеНастройки.УбратьВидимость) КАК УбратьВидимость,
	|	МАКСИМУМ(ПрименимыеНастройки.ТолькоПросмотр) КАК ТолькоПросмотр,
	|	МАКСИМУМ(ПрименимыеНастройки.Обязательное) КАК Обязательное,
	|	МАКСИМУМ(ПрименимыеНастройки.НеБлокироватьСостояниемДокумента) КАК НеБлокироватьСостояниемДокумента
	|ПОМЕСТИТЬ ПользовательскиеНастройкиДоступности
	|ИЗ
	|	ПрименимыеНастройки КАК ПрименимыеНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПриоритеты КАК МинимальныеПриоритеты
	|		ПО ПрименимыеНастройки.ИмяЭлемента = МинимальныеПриоритеты.ИмяЭлемента
	|			И ПрименимыеНастройки.ПриоритетНастройки = МинимальныеПриоритеты.ПриоритетНастройки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрименимыеНастройки.ИмяЭлемента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭлементыБлокируемыеДокументом.ИмяЭлемента КАК ИмяЭлемента
	|ПОМЕСТИТЬ ЗаблокированныеЭлементы
	|ИЗ
	|	ЭлементыБлокируемыеДокументом КАК ЭлементыБлокируемыеДокументом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПользовательскиеНастройкиДоступности КАК ПользовательскиеНастройкиДоступности
	|		ПО ЭлементыБлокируемыеДокументом.ИмяЭлемента = ПользовательскиеНастройкиДоступности.ИмяЭлемента
	|			И (ПользовательскиеНастройкиДоступности.НеБлокироватьСостояниемДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПользовательскиеНастройкиДоступности КАК НастройкиДоступностиВсехЭлементов
	|		ПО (НастройкиДоступностиВсехЭлементов.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.бит_ВидыЭлементовУправления.ВсяФорма))
	|			И (НастройкиДоступностиВсехЭлементов.НеБлокироватьСостояниемДокумента)
	|ГДЕ
	|	ПользовательскиеНастройкиДоступности.ИмяЭлемента ЕСТЬ NULL
	|	И НастройкиДоступностиВсехЭлементов.ИмяЭлемента ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПользовательскиеНастройкиДоступности.ИмяЭлемента КАК ИмяЭлемента,
	|	ПользовательскиеНастройкиДоступности.ИмяРеквизита КАК ИмяРеквизита,
	|	ПользовательскиеНастройкиДоступности.УбратьВидимость КАК УбратьВидимость,
	|	ВЫБОР
	|		КОГДА ЗаблокированныеЭлементы.ИмяЭлемента ЕСТЬ NULL
	|			ТОГДА ПользовательскиеНастройкиДоступности.ТолькоПросмотр
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТолькоПросмотр,
	|	ПользовательскиеНастройкиДоступности.Обязательное КАК Обязательное,
	|	ПользовательскиеНастройкиДоступности.ИмяЭлемента В (&ЭлементыПрограммнойБлокировки) КАК ПрограммнаяБлокировка
	|ИЗ
	|	ПользовательскиеНастройкиДоступности КАК ПользовательскиеНастройкиДоступности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаблокированныеЭлементы КАК ЗаблокированныеЭлементы
	|		ПО ПользовательскиеНастройкиДоступности.ИмяЭлемента = ЗаблокированныеЭлементы.ИмяЭлемента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаблокированныеЭлементы.ИмяЭлемента,
	|	NULL,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЗаблокированныеЭлементы.ИмяЭлемента В (&ЭлементыПрограммнойБлокировки)
	|ИЗ
	|	ЗаблокированныеЭлементы КАК ЗаблокированныеЭлементы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПользовательскиеНастройкиДоступности КАК ПользовательскиеНастройкиДоступности
	|		ПО ЗаблокированныеЭлементы.ИмяЭлемента = ПользовательскиеНастройкиДоступности.ИмяЭлемента
	|ГДЕ
	|	ПользовательскиеНастройкиДоступности.ИмяЭлемента ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ВыполненныеУсловия", ВыполненныеУсловия);
	
	ЭлементыПрограммнойБлокировки = ЭлементыПрограммнойБлокировкиНастройкиДоступности(ОбъектСистемы);
	Запрос.УстановитьПараметр("ЭлементыПрограммнойБлокировки", ЭлементыПрограммнойБлокировки);
	
	НастройкиДоступности = Запрос.Выполнить().Выгрузить();
	
	ДобавитьБлокировкуФормыПоБлокирующимСтатусам(НастройкиДоступности, ТекущийСтатус);
	Если Форма <> Неопределено Тогда
		ДобавитьБлокировкиПодчиненныхЭлементовТаблицФорм(НастройкиДоступности, Форма, Исключения);
	КонецЕсли;
		
	Возврат НастройкиДоступности;
	
КонецФункции

Функция ОписаниеСвойствРеквизитовОбъекта(ОбъектСистемы, АдресТаблицыРеквизитовФормы) Экспорт
	
	ПутиКДанным            = Новый Соответствие;
	ТаблицаРеквизитовФормы = ПолучитьИзВременногоХранилища(АдресТаблицыРеквизитовФормы);
	
	ПолнеИмяОбъекта   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъектаПолное");
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолнеИмяОбъекта);
	
	ТаблицаОписанияСвойствОбъекта = Новый ТаблицаЗначений;
	ТаблицаОписанияСвойствОбъекта.Колонки.Добавить("ИмяРеквизита");
	ТаблицаОписанияСвойствОбъекта.Колонки.Добавить("Синоним");
	
	Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		СтрокаОписания = ТаблицаОписанияСвойствОбъекта.Добавить();
		СтрокаОписания.ИмяРеквизита = Реквизит.Имя;
		СтрокаОписания.Синоним      = Реквизит.Синоним;
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		СтрокаОписания = ТаблицаОписанияСвойствОбъекта.Добавить();
		СтрокаОписания.ИмяРеквизита = Реквизит.Имя;
		СтрокаОписания.Синоним      = Реквизит.Синоним;
	КонецЦикла;
	
	Для каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		СтрокаОписания = ТаблицаОписанияСвойствОбъекта.Добавить();
		СтрокаОписания.ИмяРеквизита = ТабличнаяЧасть.Имя;
		СтрокаОписания.Синоним      = ТабличнаяЧасть.Синоним;
		
		Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			СтрокаОписания = ТаблицаОписанияСвойствОбъекта.Добавить();
			СтрокаОписания.ИмяРеквизита = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			СтрокаОписания.Синоним      = Реквизит.Синоним;
		КонецЦикла; 
	КонецЦикла;
	
	Для каждого СтрокаРеквизита Из ТаблицаРеквизитовФормы Цикл
		ПутьКДанным = СтрокаРеквизита.ПутьКДанным;
		Если Не СтрНачинаетсяС(ПутьКДанным, "Объект.") Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным    = СтрЗаменить(ПутьКДанным, "Объект.", "");
		СтрокаСвойства = ТаблицаОписанияСвойствОбъекта.Найти(ПутьКДанным, "ИмяРеквизита");
		Синоним        = ?(СтрокаСвойства = Неопределено, "", СтрокаСвойства.Синоним);
		
		ПараметрыРеквизита = Новый Структура;
		ПараметрыРеквизита.Вставить("ПутьКДанным", ПутьКДанным);
		ПараметрыРеквизита.Вставить("Синоним",     Синоним);
		ПутиКДанным.Вставить(СтрокаРеквизита.ИмяЭлементаУправления, ПараметрыРеквизита);
	КонецЦикла;
	
	Возврат ПутиКДанным;
	
КонецФункции

// Процедура обработчик подписки "бит_ПередЗаписьюДокументаНастройкаДоступностиЭлементов" на событие  "ПередЗаписью".
// 
// Параметры:
//  Источник        - ДокументОбъект.
//  Отказ           - Булево.
//  РежимЗаписи     - РежимЗаписиДокумента.
//  РежимПроведения - РежимПроведенияДокумента.
// 
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбработкаПодпискиПередЗаписьюОбъекта(Источник, Отказ);
	
КонецПроцедуры

// Процедура обработчик подписки "бит_ПередЗаписьюНастройкаДоступностиЭлементов" на событие  "ПередЗаписью".
// 
// Параметры:
//  Источник - СправочникОбъект.
//
Процедура ПередЗаписьюОбъекта(Источник, Отказ) Экспорт
	
	ОбработкаПодпискиПередЗаписьюОбъекта(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подготавливает реквизитный состав формы.
//
Процедура ПодготовитьФормуНаСервере(Форма, СтандартнаяОбработка = Ложь, ОбъектФормы = Неопределено)
	
	Если ФормаПодготовлена(Форма) Тогда
		РазблокироватьЭлементы(Форма);
	Иначе
		ДобавитьСлужебныеРеквизиты(Форма);
	КонецЕсли;
	
	ПараметрыФормы = Форма.Параметры;

	Если ПараметрыФормы.Свойство("АнализЭлементовУправленияФормы")
		И ПараметрыФормы.Свойство("АдресТаблицыРеквизитовФормы") Тогда
		ВыполнитьАнализЭлементовУправленияФормы(Форма, СтандартнаяОбработка);
	Иначе
		ОбновитьОграниченияРедактированияРеквизитов(Форма, ОбъектФормы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиДоступности(Форма, ОбъектФормы = Неопределено)

	Если ФормаПодготовлена(Форма) Тогда
		РазблокироватьЭлементы(Форма);
	Иначе
		ДобавитьСлужебныеРеквизиты(Форма);
	КонецЕсли;
	
	ОбновитьОграниченияРедактированияРеквизитов(Форма, ОбъектФормы);
	
КонецПроцедуры

Функция ФормаПодготовлена(Форма)
	
	Возврат бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(Форма);
	
КонецФункции

Процедура ОбновитьОграниченияРедактированияРеквизитов(Форма, ОбъектФормы = Неопределено)
		
	Форма.ОграниченияРедактированияРеквизитов.Очистить();
	Форма.ЭлементыПрограммнойБлокировки.Очистить();
	
	Если ОбъектФормы = Неопределено Тогда
		Попытка
			ОбъектФормы	   = Форма.РеквизитФормыВЗначение("Объект");
		Исключение
			ОписаниеОшибки = НСтр("ru='Не удалось применить настройки доступности элементов. Возможно объект был изменен.';
								 	|en='Failed to apply item accessibility settings. Perhaps the object has been modified.'");
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки;
	КонецЕсли;
	
	НастройкиДоступности = НастройкиДоступностиЭлементов(ОбъектФормы, Форма);
	Если НЕ ЗначениеЗаполнено(НастройкиДоступности) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаНастройки Из НастройкиДоступности Цикл
		СтрокаПараметра = Форма.ОграниченияРедактированияРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтрокаНастройки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьБлокировкуФормыПоБлокирующимСтатусам(НастройкиДоступности, ТекущийСтатус)
	
	Если НЕ Справочники.бит_СтатусыОбъектов.ЭтоБлокирующийСтатус(ТекущийСтатус) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаВсейФормы = НастройкиДоступности.Найти("ВсеЭлементыФормы", "ИмяЭлемента");
	
	Если НастройкаВсейФормы <> Неопределено
		И НастройкаВсейФормы.ТолькоПросмотр Тогда
		// Блокировка уже выполняется по другому условию.
		Возврат;
	КонецЕсли;
	
	Если НастройкаВсейФормы = Неопределено Тогда
		НастройкаВсейФормы = НастройкиДоступности.Добавить();
		НастройкаВсейФормы.ИмяЭлемента     = "ВсеЭлементыФормы";
		НастройкаВсейФормы.ИмяРеквизита    = "";
		НастройкаВсейФормы.УбратьВидимость = Ложь;
		НастройкаВсейФормы.ТолькоПросмотр  = Истина;
		НастройкаВсейФормы.Обязательное    = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАнализЭлементовУправленияФормы(Форма, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	АдресТаблицыРеквизитовФормы = Форма.Параметры.АдресТаблицыРеквизитовФормы;
	Если НЕ ЭтоАдресВременногоХранилища(АдресТаблицыРеквизитовФормы) Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтрока100     = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	ТаблицаРеквизтов = Новый ТаблицаЗначений;
	ТаблицаРеквизтов.Колонки.Добавить("ИмяЭлементаУправления", ТипСтрока100);
	ТаблицаРеквизтов.Колонки.Добавить("ПутьКДанным",           ТипСтрока100);
	
	Для каждого ЭлементУправления Из Форма.Элементы Цикл
		
		Если ТипЗнч(ЭлементУправления) <> Тип("ПолеФормы")
			И ТипЗнч(ЭлементУправления) <> Тип("ТаблицаФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементУправления.ПутьКДанным;
		Если ПустаяСтрока(ПутьКДанным) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРеквизита = ТаблицаРеквизтов.Добавить();
		СтрокаРеквизита.ИмяЭлементаУправления = ЭлементУправления.Имя;
		СтрокаРеквизита.ПутьКДанным           = ПутьКДанным;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРеквизтов, АдресТаблицыРеквизитовФормы);

КонецПроцедуры

Процедура ДобавитьСлужебныеРеквизиты(Форма)

	ОписаниеТиповСтрока150 = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	ОписаниеТиповБулево    = Новый ОписаниеТипов("Булево");

	ДобавляемыеРеквизиты = Новый Массив;
	
	// Добавление реквизитов на форму.
	ИмяТаблицы = "ОграниченияРедактированияРеквизитов"; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяЭлемента",           ОписаниеТиповСтрока150, ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УбратьВидимость",       ОписаниеТиповБулево,    ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТолькоПросмотр",        ОписаниеТиповБулево,    ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Обязательное",          ОписаниеТиповБулево,    ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВидимостьИзменена",     ОписаниеТиповБулево,    ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТолькоПросмотрИзменен", ОписаниеТиповБулево,    ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПрограммнаяБлокировка", ОписаниеТиповБулево,    ИмяТаблицы));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЭлементыПрограммнойБлокировки",
									Новый ОписаниеТипов("СписокЗначений")));
														
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	

КонецПроцедуры

Процедура ОбработкаПодпискиПередЗаписьюОбъекта(Источник, Отказ)
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	// Свойство "ОтключитьМеханизмНастройкиДоступности" может отключать проверку.
	ОтключитьМеханизмНастройкиДоступности = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
												Источник.ДополнительныеСвойства, 
												"ОтключитьМеханизмНастройкиДоступности", Ложь);
												
	Если ОтключитьМеханизмНастройкиДоступности Тогда
		Возврат;		
	КонецЕсли;	

	НастройкиДоступности = НастройкиДоступностиЭлементов(Источник,, Перечисления.бит_ВидыЭлементовУправления.ВсяФорма);
	Если НастройкиДоступности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаНастройки Из НастройкиДоступности Цикл
		Если СтрокаНастройки.ТолькоПросмотр Тогда
			ТекстСообщения = НСтр("ru='Изменение документа запрещено настройкой доступности.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьБлокировкиПодчиненныхЭлементовТаблицФорм(НастройкиДоступности, Форма, Исключения)
	
	Для каждого СтрокаНастройки Из НастройкиДоступности Цикл
		Если НЕ СтрокаНастройки.ТолькоПросмотр Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы = Форма.Элементы.Найти(СтрокаНастройки.ИмяЭлемента);
		Если ТипЗнч(ЭлементФормы) <> Тип("ТаблицаФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьБлокировкиПодчиненныхЭлементовГруппы(НастройкиДоступности, ЭлементФормы, Исключения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьБлокировкиПодчиненныхЭлементовГруппы(НастройкиДоступности, ГруппаФормы, Исключения)
	
	Для каждого ПодчиненныйЭлемент Из ГруппаФормы.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ДобавитьБлокировкиПодчиненныхЭлементовГруппы(НастройкиДоступности, ПодчиненныйЭлемент, Исключения);
			Продолжить;
		КонецЕсли;
		
		ИмяПодчиненногоЭлемента = ПодчиненныйЭлемент.Имя;
		СтрокаНастройки         = НастройкиДоступности.Найти(ИмяПодчиненногоЭлемента, "ИмяЭлемента");
		Если СтрокаНастройки <> Неопределено Тогда
			// Текущий элемент имеет собственную настройку доступности,
			//	в таком случае признак блокировки таблицы формы на него не распространяется.
			Продолжить;
		КонецЕсли;
		
		Если Исключения.НайтиПоЗначению(ИмяПодчиненногоЭлемента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНастройки = НастройкиДоступности.Добавить();
		СтрокаНастройки.ИмяЭлемента     = ИмяПодчиненногоЭлемента;
		СтрокаНастройки.ИмяРеквизита    = "";
		СтрокаНастройки.ТолькоПросмотр  = Истина;
		СтрокаНастройки.Обязательное    = Ложь;
		СтрокаНастройки.УбратьВидимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
